---
kind: method
id: M:Autodesk.Revit.DB.Architecture.RoomTagFilter.#ctor
source: html/5fbdb343-c1ea-4e9b-7fed-ab57e2491842.htm
---
# Autodesk.Revit.DB.Architecture.RoomTagFilter.#ctor Method

Constructs a filter which matches only rooms.

## Syntax (C#)
```csharp
public RoomTagFilter()
```